apache/nuttx/arch/arm/src/nrf52/nrf52_usbd.c
/****************************************************************************
 * arch/arm/src/nrf52/nrf52_usbd.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/param.h>
#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>

#include <nuttx/irq.h>

#include "arm_internal.h"
#include "nrf52_usbd.h"

#include "hardware/nrf52_usbd.h"
#include "hardware/nrf52_power.h"
#include "hardware/nrf52_utils.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* USB trace ****************************************************************/

/* Trace error codes */

#define NRF52_TRACEERR_ALLOCFAIL            0x01
#define NRF52_TRACEERR_BADEPNO              0x02
#define NRF52_TRACEERR_BINDFAILED           0x03
#define NRF52_TRACEERR_DRIVER               0x04
#define NRF52_TRACEERR_DRIVERREGISTERED     0x05
#define NRF52_TRACEERR_INVALIDPARMS         0x06
#define NRF52_TRACEERR_NOEP                 0x07
#define NRF52_TRACEERR_NOTCONFIGURED        0x08
#define NRF52_TRACEERR_EPOUTQEMPTY          0x09
#define NRF52_TRACEERR_EPOUTNULLPACKET      0x0b
#define NRF52_TRACEERR_EP0NOSETUP           0x0c
#define NRF52_TRACEERR_EP0SETUPSTALLED      0x0d
#define NRF52_TRACEERR_DISPATCHSTALL        0x0e
#define NRF52_TRACEERR_BADEPGETSTATUS       0x0f
#define NRF52_TRACEERR_BADDEVGETSTATUS      0x10
#define NRF52_TRACEERR_BADCLEARFEATURE      0x11
#define NRF52_TRACEERR_BADSETFEATURE        0x12
#define NRF52_TRACEERR_INVALIDCTRLREQ       0x17
#define NRF52_TRACEERR_BADGETSTATUS         0x18
#define NRF52_TRACEERR_EPINREQEMPTY         0x19
#define NRF52_TRACEERR_DMABUSY              0x20

/* Trace interrupt codes */

/* USB Interrupt entry/exit */

#define NRF52_TRACEINTID_USB                1

/* On each pass through the loop */

#define NRF52_TRACEINTID_INTPENDING         2

/* First level interrupt decode */

#define NRF52_TRACEINTID_DEVRESET           (10 + 0)
#define NRF52_TRACEINTID_STARTED            (10 + 1)
#define NRF52_TRACEINTID_ENDEPIN            (10 + 2)
#define NRF52_TRACEINTID_ENDISOIN           (10 + 4)
#define NRF52_TRACEINTID_ENDEPOUT           (10 + 5)
#define NRF52_TRACEINTID_ENDISOOUT          (10 + 6)
#define NRF52_TRACEINTID_SOF                (10 + 7)
#define NRF52_TRACEINTID_USBEVENT           (10 + 8)
#define NRF52_TRACEINTID_EP0SETUP           (10 + 9)
#define NRF52_TRACEINTID_EP0DATADONE        (10 + 10)
#define NRF52_TRACEINTID_EPDATA             (10 + 11)

/* USBEVENT second level decode */

#define NRF52_TRACEINTID_ISOOUTCRC          (30 + 0)
#define NRF52_TRACEINTID_SUSPEND            (30 + 1)
#define NRF52_TRACEINTID_RESUME             (30 + 2)
#define NRF52_TRACEINTID_USBWUALLOWED       (30 + 3)
#define NRF52_TRACEINTID_READY              (30 + 4)

/* EPOUT second level decode */

#define NRF52_TRACEINTID_DISPATCH           (50 + 0)
#define NRF52_TRACEINTID_GETSTATUS          (50 + 1)
#define NRF52_TRACEINTID_DEVGETSTATUS       (50 + 2)
#define NRF52_TRACEINTID_IFGETSTATUS        (50 + 3)
#define NRF52_TRACEINTID_CLEARFEATURE       (50 + 4)
#define NRF52_TRACEINTID_SETFEATURE         (50 + 5)
#define NRF52_TRACEINTID_SETADDRESS         (50 + 6)
#define NRF52_TRACEINTID_GETSETDESC         (50 + 7)
#define NRF52_TRACEINTID_GETSETIFCONFIG     (50 + 8)
#define NRF52_TRACEINTID_SYNCHFRAME         (50 + 9)
#define NRF52_TRACEINTID_EPGETSTATUS        (50 + 10)
#define NRF52_TRACEINTID_TESTMODE           (50 + 11)

/* Low level USBD decode */

#define NRF52_TRACEINTID_DMATASK            (70 + 0)
#define NRF52_TRACEINTID_DMAACK             (70 + 1)
#define NRF52_TRACEINTID_EPINSTART          (70 + 2)
#define NRF52_TRACEINTID_EPINSTOP           (70 + 3)
#define NRF52_TRACEINTID_EPOUTSTART         (70 + 4)
#define NRF52_TRACEINTID_EPOUTSTOP          (70 + 5)
#define NRF52_TRACEINTID_EP0RCVOUT          (70 + 6)
#define NRF52_TRACEINTID_EP0STATUS          (70 + 7)

/* Configuration ************************************************************/

#define USBDEV_EP0_MAXSIZE       (64)
#define USBDEV_SETUP_MAXDATASIZE (USBDEV_EP0_MAXSIZE * 4)

#ifdef CONFIG_USBDEV_ISOCHRONOUS
#  error not supported yet
#endif

#ifdef CONFIG_USBDEV_LOWPOWER
#  error not supported yet
#endif

/* Endpoints ****************************************************************/

/* Odd physical endpoint numbers are IN; even are OUT */

#define NRF52_EPPHYIN2LOG(epphy)     ((uint8_t)(epphy)|USB_DIR_IN)
#define NRF52_EPPHYOUT2LOG(epphy)    ((uint8_t)(epphy)|USB_DIR_OUT)

/* Endpoint 0 - control */

#define EP0                   (0)

/* The set of all endpoints available to the class implementation (1-7) */

#define NRF52_EP_AVAILABLE    (0x0fe)       /* All available endpoints */

/* Maximum packet sizes for full speed endpoints */

