apache/nuttx/arch/arm/src/nrf52/nrf52_usbd.c
#define NRF52_MAXPACKET_SIZE  (64)

/* Request queue operations *************************************************/

#define nrf52_rqempty(ep)     ((ep)->head == NULL)
#define nrf52_rqpeek(ep)      ((ep)->head)

/* Interrupts ***************************************************************/

#ifdef CONFIG_USBDEV_SOFINTERRUPT
#  error TODO
#else
#define NRF52_INT_DEFAULT     (USBD_INT_USBRESET |                     \
                               USBD_INT_EP0DATADONE |                  \
                               USBD_INT_USBEVENT |                     \
                               USBD_INT_EP0SETUP |                     \
                               USBD_INT_EPDATA)
#endif

/* Interrupts that signal DMA transfer complete:
 *   ENDEPIN0-7, ENDEPOUT0-7, ENDISOIN, ENDISOOUT
 */

#define NRF52_USBD_DMAIRQ (USBD_INT_ENDEPIN(0) | USBD_INT_ENDEPIN(1)   | \
                           USBD_INT_ENDEPIN(2) | USBD_INT_ENDEPIN(3)   | \
                           USBD_INT_ENDEPIN(4) | USBD_INT_ENDEPIN(5)   | \
                           USBD_INT_ENDEPIN(6) | USBD_INT_ENDEPIN(7)   | \
                           USBD_INT_ENDEPOUT(0) | USBD_INT_ENDEPOUT(1) | \
                           USBD_INT_ENDEPOUT(2) | USBD_INT_ENDEPOUT(3) | \
                           USBD_INT_ENDEPOUT(4) | USBD_INT_ENDEPOUT(5) | \
                           USBD_INT_ENDEPOUT(6) | USBD_INT_ENDEPOUT(7) | \
                           USBD_INT_ENDISOIN | USBD_INT_ENDISOOUT)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Parsed control request */

struct nrf52_ctrlreq_s
{
  uint8_t  type;
  uint8_t  req;
  uint16_t value;
  uint16_t index;
  uint16_t len;
};

/* A container for a request so that the request may be retained in a list */

struct nrf52_req_s
{
  struct usbdev_req_s  req;           /* Standard USB request */
  struct nrf52_req_s  *flink;         /* Supports a singly linked list */
};

/* This is the internal representation of an endpoint */

struct nrf52_ep_s
{
  /* Common endpoint fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_ep_s
   * to struct nrf52_ep_s.
   */

  struct usbdev_ep_s     ep;            /* Standard endpoint structure */

  /* NRF52-specific fields */

  struct nrf52_usbdev_s *dev;          /* Reference to private driver data */
  struct nrf52_req_s    *head;         /* Request list for this endpoint */
  struct nrf52_req_s    *tail;
  uint8_t               *rxbuff;       /* RX buffer */
  uint8_t                epphy;        /* Physical EP address */
  uint8_t                eptype:2;     /* Endpoint type */
  uint8_t                stalled:1;    /* 1: Endpoint is stalled */
  uint8_t                isin:1;       /* 1: IN Endpoint */
};

/* NRF52 USB device */

struct nrf52_usbdev_s
{
  /* Common device fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_s
   * to structnrf52_usbdev_s.
   */

  struct usbdev_s usbdev;

  /* The bound device class driver */

  struct usbdevclass_driver_s *driver;

  /* NRF52-specific fields */

  uint8_t                 stalled:1;     /* 1: Protocol stalled */
  uint8_t                 selfpowered:1; /* 1: Device is self powered */
  uint8_t                 addressed:1;   /* 1: Peripheral address has been set */
  uint8_t                 wakeup:1;      /* 1: Device remote wake-up */
  uint8_t                 ep0indone;     /* 1: EP0 IN transfer complete */
  uint8_t                 ep0outdone;    /* 1: EP0 OUT transfer complete */
  uint8_t                 epavail[2];    /* Bitset of available OUT/IN endpoints */

  /* DMA access control */

  bool                    dmanow;        /* DMA transfer pending */
  uint16_t                dmaepinwait;   /* EP IN waiting for DMA */
  uint16_t                dmaepoutwait;  /* EP OUT waitning for DMA */
  uint16_t                epinflight;    /* EP IN packet armed, awaiting
                                          * host read (EPDATASTATUS) */

  /* E0 SETUP data buffering.
   *
   * ctrl
   *   The 8-byte SETUP request is received on the EP0 OUT endpoint and is
   *   saved.
   *
   * ep0data
   *   For OUT SETUP requests, the SETUP data phase must also complete
   *   before the SETUP command can be processed.
   *
   * ep0datlen
   *   Length of OUT DATA received in ep0data[]
   */

  struct usb_ctrlreq_s   ctrlreq;
  uint8_t                ep0data[USBDEV_SETUP_MAXDATASIZE];
  uint16_t               ep0datlen;
  uint16_t               ep0reqlen;

  /* The endpoint list */

  struct nrf52_ep_s      epin[NRF52_NENDPOINTS];
  struct nrf52_ep_s      epout[NRF52_NENDPOINTS];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations ******************************************************/

#define nrf52_getreg(addr)     getreg32(addr)
#define nrf52_putreg(val,addr) putreg32(val,addr)

/* DMA operations ***********************************************************/

static void nrf52_startdma_task(struct nrf52_usbdev_s *priv, uint32_t addr);
static void nrf52_startdma_ack(struct nrf52_usbdev_s *priv);

static void nrf52_epout_start(struct nrf52_usbdev_s *priv, int epno);
static void nrf52_epout_stop(struct nrf52_usbdev_s *priv, int epno);
static void nrf52_epin_start(struct nrf52_usbdev_s *priv, int epno);
static void nrf52_epin_stop(struct nrf52_usbdev_s *priv, int epno);
static void nrf52_ep0rcvout_start(struct nrf52_usbdev_s *priv);
static void nrf52_ep0status_start(struct nrf52_usbdev_s *priv);

/* Request queue operations *************************************************/

static struct nrf52_req_s *nrf52_req_remfirst(struct nrf52_ep_s *privep);
static bool nrf52_req_addlast(struct nrf52_ep_s *privep,
                              struct nrf52_req_s *req);

/* Low level data transfers and request operations **************************/

/* Special endpoint 0 data transfer logic */

static void nrf52_ep0out_stdrequest(struct nrf52_usbdev_s *priv,
                                    struct nrf52_ctrlreq_s *ctrlreq);
static void nrf52_ep0setup(struct nrf52_usbdev_s *priv);

/* IN request handling */

static void nrf52_epin_transfer(struct nrf52_ep_s *privep, uint8_t *buf,
                                int nbytes);
static void nrf52_epin_request(struct nrf52_usbdev_s *priv,
                               struct nrf52_ep_s *privep);

/* OUT request handling */

static void nrf52_epout_allow(struct nrf52_ep_s *privep);
static void nrf52_epout_transfer(struct nrf52_ep_s *privep);

static void nrf52_epout_complete(struct nrf52_ep_s *privep);
static void nrf52_ep0out_receive(struct nrf52_usbdev_s *priv);
static void nrf52_epout_receive(struct nrf52_ep_s *privep);
static void nrf52_epout_handle(struct nrf52_usbdev_s *priv,
                                struct nrf52_ep_s *privep);

/* General request handling */

static void nrf52_req_complete(struct nrf52_ep_s *privep, int16_t result);
static void nrf52_req_cancel(struct nrf52_ep_s *privep, int16_t status);
static int nrf52_req_dispatch(struct nrf52_usbdev_s *priv,
                              const struct usb_ctrlreq_s *ctrl);

