apache/nuttx/arch/arm/src/nrf52/nrf52_usbd.c
/* Interrupt handling *******************************************************/

static struct nrf52_ep_s *
nrf52_ep_findbyaddr(struct nrf52_usbdev_s *priv, uint16_t eplog);
static void nrf52_usbreset(struct nrf52_usbdev_s *priv);

/* Other second level interrupt processing */

static void nrf52_resumeinterrupt(struct nrf52_usbdev_s *priv);
static void nrf52_suspendinterrupt(struct nrf52_usbdev_s *priv);
static void nrf52_eventinterrupt(struct nrf52_usbdev_s *priv);
static void nrf52_ep0setupinterrupt(struct nrf52_usbdev_s *priv);
static void nrf52_ep0datainterrupt(struct nrf52_usbdev_s *priv);
static void nrf52_epdatainterrupt(struct nrf52_usbdev_s *priv);
static void nrf52_endepininterrupt(struct nrf52_usbdev_s *priv,
                                   uint32_t irqnow);
static void nrf52_endepoutinterrupt(struct nrf52_usbdev_s *priv,
                                    uint32_t irqnow);

/* First level interrupt processing */

static int nrf52_usbinterrupt(int irq, void *context, void *arg);

/* Endpoint operations ******************************************************/

/* Endpoint configuration */

static int nrf52_epout_configure(struct nrf52_ep_s *privep, uint8_t eptype,
                                 uint16_t maxpacket);
static int nrf52_epin_configure(struct nrf52_ep_s *privep, uint8_t eptype,
                                uint16_t maxpacket);
static int nrf52_ep_configure(struct usbdev_ep_s *ep,
                              const struct usb_epdesc_s *desc, bool last);
static void nrf52_ep0_configure(struct nrf52_usbdev_s *priv);

/* Endpoint disable */

static void nrf52_epout_disable(struct nrf52_ep_s *privep);
static void nrf52_epin_disable(struct nrf52_ep_s *privep);
static int  nrf52_ep_disable(struct usbdev_ep_s *ep);

/* Endpoint request management */

static struct usbdev_req_s *nrf52_ep_allocreq(struct usbdev_ep_s *ep);
static void nrf52_ep_freereq(struct usbdev_ep_s *ep, struct usbdev_req_s *);

/* Endpoint buffer management */

#ifdef CONFIG_USBDEV_DMA
static void *nrf52_ep_allocbuffer(struct usbdev_ep_s *ep, unsigned bytes);
static void nrf52_ep_freebuffer(struct usbdev_ep_s *ep, void *buf);
#endif

/* Endpoint request submission */

static int nrf52_ep_submit(struct usbdev_ep_s *ep, struct usbdev_req_s *req);

/* Endpoint request cancellation */

static int nrf52_ep_cancel(struct usbdev_ep_s *ep, struct usbdev_req_s *req);

/* Stall handling */

static int nrf52_ep_setstall(struct nrf52_ep_s *privep);
static int nrf52_ep_clrstall(struct nrf52_ep_s *privep);
static int nrf52_ep_stall(struct usbdev_ep_s *ep, bool resume);
static void nrf52_ep0_stall(struct nrf52_usbdev_s *priv);

/* Endpoint allocation */

static struct usbdev_ep_s *
nrf52_ep_alloc(struct usbdev_s *dev, uint8_t epno, bool in, uint8_t eptype);
static void nrf52_ep_free(struct usbdev_s *dev, struct usbdev_ep_s *ep);

/* USB device controller operations *****************************************/

static int nrf52_getframe(struct usbdev_s *dev);
static int nrf52_wakeup(struct usbdev_s *dev);
static int nrf52_selfpowered(struct usbdev_s *dev, bool selfpowered);
static int nrf52_pullup(struct usbdev_s *dev, bool enable);
static void nrf52_setaddress(struct nrf52_usbdev_s *priv, uint16_t address);

/* Initialization ***********************************************************/

static void nrf52_swinitialize(struct nrf52_usbdev_s *priv);
static void nrf52_hwinitialize(struct nrf52_usbdev_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct nrf52_usbdev_s g_usbdev;

/* USB endpoint ops */

static const struct usbdev_epops_s g_epops =
{
  .configure   = nrf52_ep_configure,
  .disable     = nrf52_ep_disable,
  .allocreq    = nrf52_ep_allocreq,
  .freereq     = nrf52_ep_freereq,
#ifdef CONFIG_USBDEV_DMA
  .allocbuffer = nrf52_ep_allocbuffer,
  .freebuffer  = nrf52_ep_freebuffer,
#endif
  .submit      = nrf52_ep_submit,
  .cancel      = nrf52_ep_cancel,
  .stall       = nrf52_ep_stall,
};

/* USB device ops */

static const struct usbdev_ops_s g_devops =
{
  .allocep     = nrf52_ep_alloc,
  .freeep      = nrf52_ep_free,
  .getframe    = nrf52_getframe,
  .wakeup      = nrf52_wakeup,
  .selfpowered = nrf52_selfpowered,
  .pullup      = nrf52_pullup,
};

/****************************************************************************
 * Public Data
 ****************************************************************************/

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_deverror[] =
{
  TRACE_STR(NRF52_TRACEERR_ALLOCFAIL),
  TRACE_STR(NRF52_TRACEERR_BADEPNO),
  TRACE_STR(NRF52_TRACEERR_BINDFAILED),
  TRACE_STR(NRF52_TRACEERR_DRIVER),
  TRACE_STR(NRF52_TRACEERR_DRIVERREGISTERED),
  TRACE_STR(NRF52_TRACEERR_INVALIDPARMS),
  TRACE_STR(NRF52_TRACEERR_NOEP),
  TRACE_STR(NRF52_TRACEERR_NOTCONFIGURED),
  TRACE_STR(NRF52_TRACEERR_EPOUTQEMPTY),
  TRACE_STR(NRF52_TRACEERR_EPOUTNULLPACKET),
  TRACE_STR(NRF52_TRACEERR_EP0NOSETUP),
  TRACE_STR(NRF52_TRACEERR_EP0SETUPSTALLED),
  TRACE_STR(NRF52_TRACEERR_DISPATCHSTALL),
  TRACE_STR(NRF52_TRACEERR_BADEPGETSTATUS),
  TRACE_STR(NRF52_TRACEERR_BADEPGETSTATUS),
  TRACE_STR(NRF52_TRACEERR_BADDEVGETSTATUS),
  TRACE_STR(NRF52_TRACEERR_BADCLEARFEATURE),
  TRACE_STR(NRF52_TRACEERR_BADSETFEATURE),
  TRACE_STR(NRF52_TRACEERR_INVALIDCTRLREQ),
  TRACE_STR(NRF52_TRACEERR_BADGETSTATUS),
  TRACE_STR(NRF52_TRACEERR_EPINREQEMPTY),
  TRACE_STR_END
};
#endif

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_intdecode[] =
{
  TRACE_STR(NRF52_TRACEINTID_USB),
  TRACE_STR(NRF52_TRACEINTID_INTPENDING),

  TRACE_STR(NRF52_TRACEINTID_DEVRESET),
  TRACE_STR(NRF52_TRACEINTID_STARTED),
  TRACE_STR(NRF52_TRACEINTID_ENDEPIN),
  TRACE_STR(NRF52_TRACEINTID_ENDISOIN),
  TRACE_STR(NRF52_TRACEINTID_ENDEPOUT),
  TRACE_STR(NRF52_TRACEINTID_ENDISOOUT),
  TRACE_STR(NRF52_TRACEINTID_SOF),
  TRACE_STR(NRF52_TRACEINTID_USBEVENT),
  TRACE_STR(NRF52_TRACEINTID_EP0SETUP),
  TRACE_STR(NRF52_TRACEINTID_EP0DATADONE),
  TRACE_STR(NRF52_TRACEINTID_EPDATA),

  TRACE_STR(NRF52_TRACEINTID_ISOOUTCRC),
  TRACE_STR(NRF52_TRACEINTID_SUSPEND),
  TRACE_STR(NRF52_TRACEINTID_RESUME),
  TRACE_STR(NRF52_TRACEINTID_USBWUALLOWED),
  TRACE_STR(NRF52_TRACEINTID_READY),

  TRACE_STR(NRF52_TRACEINTID_DISPATCH),
  TRACE_STR(NRF52_TRACEINTID_GETSTATUS),
  TRACE_STR(NRF52_TRACEINTID_DEVGETSTATUS),
  TRACE_STR(NRF52_TRACEINTID_IFGETSTATUS),
  TRACE_STR(NRF52_TRACEINTID_CLEARFEATURE),
  TRACE_STR(NRF52_TRACEINTID_SETFEATURE),
  TRACE_STR(NRF52_TRACEINTID_SETADDRESS),
  TRACE_STR(NRF52_TRACEINTID_GETSETDESC),
  TRACE_STR(NRF52_TRACEINTID_GETSETIFCONFIG),
  TRACE_STR(NRF52_TRACEINTID_SYNCHFRAME),
  TRACE_STR(NRF52_TRACEINTID_EPGETSTATUS),
  TRACE_STR(NRF52_TRACEINTID_TESTMODE),

