apache/nuttx/arch/arm/src/nrf52/nrf52_usbd.c
  TRACE_STR(NRF52_TRACEINTID_DMATASK),
  TRACE_STR(NRF52_TRACEINTID_DMAACK),
  TRACE_STR(NRF52_TRACEINTID_EPINSTART),
  TRACE_STR(NRF52_TRACEINTID_EPINSTOP),
  TRACE_STR(NRF52_TRACEINTID_EPOUTSTART),
  TRACE_STR(NRF52_TRACEINTID_EPOUTSTOP),
  TRACE_STR(NRF52_TRACEINTID_EP0RCVOUT),
  TRACE_STR(NRF52_TRACEINTID_EP0STATUS),

  TRACE_STR_END
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf52_startdma_task and nrf52_startdma_ack
 *
 * Description:
 *   Errata [199] USBD: USBD cannot receive tasks during DMA
 *
 ****************************************************************************/

static void nrf52_startdma_task(struct nrf52_usbdev_s *priv, uint32_t addr)
{
  usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_DMATASK), addr);
  nrf52_putreg(1, addr);
  priv->dmanow = true;
}

static void nrf52_startdma_ack(struct nrf52_usbdev_s *priv)
{
  if (priv->dmanow == true)
    {
      usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_DMAACK), 0);
      priv->dmanow = false;
    }
}

/****************************************************************************
 * Name: nrf52_xxx_start and nrf52_xxx_stop
 *
 * Description:
 *   Start or stop tasks
 *
 ****************************************************************************/

static void nrf52_epout_start(struct nrf52_usbdev_s *priv, int epno)
{
  usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EPOUTSTART), epno);
  nrf52_startdma_task(priv, NRF52_USBD_TASKS_STARTEPOUT(epno));
}

static void nrf52_epout_stop(struct nrf52_usbdev_s *priv, int epno)
{
  usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EPOUTSTOP), epno);
  nrf52_putreg(0, NRF52_USBD_TASKS_STARTEPOUT(epno));
}

static void nrf52_epin_start(struct nrf52_usbdev_s *priv, int epno)
{
  usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EPINSTART), epno);
  nrf52_startdma_task(priv, NRF52_USBD_TASKS_STARTEPIN(epno));
}

static void nrf52_epin_stop(struct nrf52_usbdev_s *priv, int epno)
{
  usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EPINSTOP), epno);
  nrf52_putreg(0, NRF52_USBD_TASKS_STARTEPIN(epno));
}

static void nrf52_ep0rcvout_start(struct nrf52_usbdev_s *priv)
{
  usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EP0RCVOUT), 0);
  nrf52_putreg(1, NRF52_USBD_TASKS_EP0RCVOUT);
}

static void nrf52_ep0status_start(struct nrf52_usbdev_s *priv)
{
  usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EP0STATUS), 0);
  nrf52_putreg(1, NRF52_USBD_TASKS_EP0STATUS);
}

/****************************************************************************
 * Name: nrf52_req_remfirst
 *
 * Description:
 *   Remove a request from the head of an endpoint request queue
 *
 ****************************************************************************/

static struct nrf52_req_s *nrf52_req_remfirst(struct nrf52_ep_s *privep)
{
  struct nrf52_req_s *ret = privep->head;

  if (ret)
    {
      privep->head = ret->flink;
      if (!privep->head)
        {
          privep->tail = NULL;
        }

      ret->flink = NULL;
    }

  return ret;
}

/****************************************************************************
 * Name: nrf52_req_addlast
 *
 * Description:
 *   Add a request to the end of an endpoint request queue
 *
 ****************************************************************************/

static bool nrf52_req_addlast(struct nrf52_ep_s *privep,
                              struct nrf52_req_s *req)
{
  bool is_empty = !privep->head;

  req->flink = NULL;
  if (is_empty)
    {
      privep->head = req;
      privep->tail = req;
    }
  else
    {
      privep->tail->flink = req;
      privep->tail        = req;
    }

  return is_empty;
}

/****************************************************************************
 * Name: nrf52_ep0out_stdrequest
 *
 * Description:
 *   Handle a standard request on EP0.  Pick off the things of interest to
 *   the USB device controller driver; pass what is left to the class driver.
 *
 ****************************************************************************/

static void
nrf52_ep0out_stdrequest(struct nrf52_usbdev_s *priv,
                        struct nrf52_ctrlreq_s *ctrlreq)
{
  struct nrf52_ep_s *privep    = NULL;
  uint8_t            recipient = 0;

  /* Handle standard request */

  switch (ctrlreq->req)
    {
    case USB_REQ_GETSTATUS:
      {
        /* type:  device-to-host; recipient = device, interface, endpoint
         * value: 0
         * index: zero interface endpoint
         * len:   2; data = status
         */

        usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_GETSTATUS), 0);
        if (!priv->addressed || ctrlreq->len != 2 ||
            USB_REQ_ISOUT(ctrlreq->type) || ctrlreq->value != 0)
          {
            priv->stalled = true;
          }
        else
          {
            switch (ctrlreq->type & USB_REQ_RECIPIENT_MASK)
              {
              case USB_REQ_RECIPIENT_ENDPOINT:
                {
                  usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EPGETSTATUS), 0);
                  privep = nrf52_ep_findbyaddr(priv, ctrlreq->index);
                  if (!privep)
                    {
                      usbtrace(
                        TRACE_DEVERROR(NRF52_TRACEERR_BADEPGETSTATUS), 0);
                      priv->stalled = true;
                    }
                  break;
                }

              case USB_REQ_RECIPIENT_DEVICE:
              case USB_REQ_RECIPIENT_INTERFACE:
                {
                  if (ctrlreq->index == 0)
                    {
                      usbtrace(TRACE_INTDECODE(
                                 NRF52_TRACEINTID_DEVGETSTATUS), 0);
                    }
                  else
                    {
                      usbtrace(TRACE_DEVERROR(
                               NRF52_TRACEERR_BADDEVGETSTATUS), 0);
                      priv->stalled = true;
                    }
                  break;
                }

              default:
                {
                  usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_BADGETSTATUS), 0);
                  priv->stalled = true;
                  break;
                }
              }
          }
        break;
      }

    case USB_REQ_CLEARFEATURE:
      {
        /* type:  host-to-device; recipient = device, interface or endpoint
         * value: feature selector
         * index: zero interface endpoint;
         * len:   zero, data = none
         */

        usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_CLEARFEATURE), 0);
        if (priv->addressed != 0 && ctrlreq->len == 0)
          {
            recipient = ctrlreq->type & USB_REQ_RECIPIENT_MASK;
            if (recipient == USB_REQ_RECIPIENT_ENDPOINT &&
                ctrlreq->value == USB_FEATURE_ENDPOINTHALT &&
                (privep = nrf52_ep_findbyaddr(priv, ctrlreq->index)) != NULL)
              {
                nrf52_ep_clrstall(privep);
              }
            else if (recipient == USB_REQ_RECIPIENT_DEVICE &&
                     ctrlreq->value == USB_FEATURE_REMOTEWAKEUP)
              {
                priv->wakeup = false;
              }
            else
              {
                nrf52_req_dispatch(priv, &priv->ctrlreq);
              }
          }
        else
          {
            usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_BADCLEARFEATURE), 0);
            priv->stalled = true;
          }
        break;
      }

    case USB_REQ_SETFEATURE:
      {
        /* type:  host-to-device; recipient = device, interface, endpoint
         * value: feature selector
         * index: zero interface endpoint;
         * len:   0; data = none
         */

        usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_SETFEATURE), 0);
        if (priv->addressed != 0 && ctrlreq->len == 0)
          {
            recipient = ctrlreq->type & USB_REQ_RECIPIENT_MASK;
            if (recipient == USB_REQ_RECIPIENT_ENDPOINT &&
                ctrlreq->value == USB_FEATURE_ENDPOINTHALT &&
                (privep = nrf52_ep_findbyaddr(priv, ctrlreq->index)) != NULL)
              {
                nrf52_ep_setstall(privep);
              }
            else if (recipient == USB_REQ_RECIPIENT_DEVICE &&
                     ctrlreq->value == USB_FEATURE_REMOTEWAKEUP)
              {
                priv->wakeup = true;
              }
            else if (recipient == USB_REQ_RECIPIENT_DEVICE &&
                     ctrlreq->value == USB_FEATURE_TESTMODE &&
                     ((ctrlreq->index & 0xff) == 0))
              {
                usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_TESTMODE), 0);
              }
            else
              {
                usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_BADSETFEATURE), 0);
                priv->stalled = true;
              }
          }
        else
          {
            usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_BADSETFEATURE), 0);
            priv->stalled = true;
          }
        break;
      }

