apache/nuttx/arch/arm/src/nrf52/nrf52_usbd.c
  nrf52_putreg(0, NRF52_USBD_SIZE_EPOUT(privep->epphy));
}

/****************************************************************************
 * Name: nrf52_epout_transfer
 *
 * Description:
 *   Start the Rx data transfer
 *
 ****************************************************************************/

static void nrf52_epout_transfer(struct nrf52_ep_s *privep)
{
  struct nrf52_usbdev_s *priv   = NULL;
  int                    nbytes = 0;

  /* Sanity Checking */

  DEBUGASSERT(privep && privep->dev);
  priv = (struct nrf52_usbdev_s *)privep->dev;

  if (privep->epphy == 0)
    {
      nbytes = USBDEV_EP0_MAXSIZE;
    }
  else
    {
      /* Number of bytes received last in the data stage of this OUT
       * endpoint
       */

      nbytes = nrf52_getreg(NRF52_USBD_SIZE_EPOUT(privep->epphy));
    }

  /* Configure EasyDMA */

  DEBUGASSERT(nrf52_easydma_valid((uint32_t)privep->rxbuff));
  nrf52_putreg((uint32_t)privep->rxbuff,
               NRF52_USBD_EPOUT_PTR(privep->epphy));
  nrf52_putreg(nbytes, NRF52_USBD_EPOUT_MAXCNT(privep->epphy));

  /* Start EPOUT task */

  nrf52_epout_start(priv, privep->epphy);

  /* Busy wait for ENDEPOUT to prevent any access to USBD registers during
   * EasyDMA transfer. Otherwise USBD is not stable.
   */

  while (nrf52_getreg(NRF52_USBD_EVENTS_ENDEPOUT(privep->epphy)) == 0 &&
         nrf52_getreg(NRF52_USBD_EVENTS_USBRESET) == 0);
}

/****************************************************************************
 * Name: nrf52_epin_request
 *
 * Description:
 *   Begin or continue write request processing.
 *
 ****************************************************************************/

static void nrf52_epin_request(struct nrf52_usbdev_s *priv,
                               struct nrf52_ep_s *privep)
{
  struct nrf52_req_s *privreq   = NULL;
  uint8_t            *buf       = NULL;
  int                 bytesleft = 0;
  int                 nbytes    = 0;

  /* If DMA is busy, add EP IN to the waiting list */

  if (priv->dmanow == true)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_DMABUSY), privep->epphy);
      priv->dmaepinwait |= (1 << privep->epphy);
      return;
    }

  /* If a packet is already armed on this data endpoint and is still waiting
   * to be read by the host, do not overwrite the endpoint buffer. The next
   * packet is sent from nrf52_epdatainterrupt() once the host has read this
   * one (EPDATASTATUS).
   */

  if (privep->epphy != EP0 &&
      (priv->epinflight & (1 << privep->epphy)) != 0)
    {
      return;
    }

  /* Check the request from the head of the endpoint request queue */

  privreq = nrf52_rqpeek(privep);
  if (!privreq)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_EPINREQEMPTY), privep->epphy);
      return;
    }

  uinfo("EP%"  PRId8 " req=%p: len=%" PRId16 " xfrd=%"  PRId16 "\n",
        privep->epphy, privreq, privreq->req.len, privreq->req.xfrd);

  /* Add one more packet.  We will wait for the transfer
   * complete event before we add the next packet.
   */

  if (privreq->req.xfrd < privreq->req.len)
    {
      /* Get the number of bytes left to be sent in the request */

      bytesleft = privreq->req.len - privreq->req.xfrd;
      nbytes    = bytesleft;

      /* Limit the size of the transfer to one full packet */

      if (nbytes > 0)
        {
          /* Either send the maxpacketsize or all of the remaining data in
           * the request.
           */

          if (nbytes >= privep->ep.maxpacket)
            {
              nbytes =  privep->ep.maxpacket;
            }
        }

      /* Transfer data */

      buf = privreq->req.buf + privreq->req.xfrd;
      nrf52_epin_transfer(privep, buf, nbytes);

      /* Mark the endpoint as having a packet awaiting host read. This must
       * be set before nrf52_req_complete() below, which may re-enter this
       * function through the class driver's completion callback.
       */

      if (privep->epphy != EP0)
        {
          priv->epinflight |= (1 << privep->epphy);
        }

      /* Update for the next time through the loop */

      privreq->req.xfrd += nbytes;
    }
  else if (privreq->req.len == 0)
    {
      /* Zero-length packet */

      nrf52_epin_transfer(privep, NULL, 0);

      if (privep->epphy != EP0)
        {
          priv->epinflight |= (1 << privep->epphy);
        }
      else
        {
          /* ACK zero-length DMA transfer right away */

          nrf52_startdma_ack(priv);
        }
    }

  /* Has all the request data been sent? */

  if (privreq->req.xfrd >= privreq->req.len)
    {
      usbtrace(TRACE_COMPLETE(privep->epphy), privreq->req.xfrd);

      /* We are finished with the request (although the transfer has not
       * yet completed).
       */

      nrf52_req_complete(privep, OK);

      if (privep->epphy == EP0)
        {
          priv->ep0indone = true;
        }
    }
}

/****************************************************************************
 * Name: nrf52_epout_complete
 *
 * Description:
 *   This function is called when an OUT transfer complete interrupt is
 *   received.  It completes the read request at the head of the endpoint's
 *   request queue.
 *
 ****************************************************************************/

static void nrf52_epout_complete(struct nrf52_ep_s *privep)
{
  struct nrf52_req_s *privreq = NULL;

  /* Sanity Checking */

  DEBUGASSERT(privep);

  /* Since a transfer just completed, there must be a read request at the
   * head of the endpoint request queue.
   */

  privreq = nrf52_rqpeek(privep);
  DEBUGASSERT(privreq);
  if (!privreq)
    {
      /* An OUT transfer completed, but no packet to receive the data.  This
       * should not happen.
       */

      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_EPOUTQEMPTY),
               privep->epphy);
      return;
    }

  uinfo("EP%d: len=%zu xfrd=%zu\n", privep->epphy, privreq->req.len,
        privreq->req.xfrd);

  /* Return the completed read request to the class driver and mark the
   * state IDLE.
   */

  usbtrace(TRACE_COMPLETE(privep->epphy), privreq->req.xfrd);
  nrf52_req_complete(privep, OK);
}

/****************************************************************************
 * Name: nrf52_ep0out_receive
 *
 * Description:
 *   This function will simply copy the incoming data into pending request's
 *   data buffer.
 *
 ****************************************************************************/

