apache/nuttx/arch/arm/src/nrf52/nrf52_usbd.c
  if (ret < 0)
    {
      /* Stall on failure */

      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_DISPATCHSTALL), 0);
      priv->stalled = true;
    }

  return ret;
}

/****************************************************************************
 * Name: nrf52_ep_findbyaddr
 *
 * Description:
 *   Find the physical endpoint structure corresponding to a logic endpoint
 *   address
 *
 ****************************************************************************/

static struct nrf52_ep_s *nrf52_ep_findbyaddr(struct nrf52_usbdev_s *priv,
                                              uint16_t eplog)
{
  struct nrf52_ep_s *privep = NULL;
  uint8_t            epphy  = USB_EPNO(eplog);

  if (epphy >= NRF52_NENDPOINTS)
    {
      return NULL;
    }

  /* Is this an IN or an OUT endpoint? */

  if (USB_ISEPIN(eplog))
    {
      privep = &priv->epin[epphy];
    }
  else
    {
      privep = &priv->epout[epphy];
    }

  /* Return endpoint reference */

  DEBUGASSERT(privep->epphy == epphy);
  return privep;
}

/****************************************************************************
 * Name: nrf52_usbreset
 *
 * Description:
 *   Reset Usb engine
 *
 ****************************************************************************/

static void nrf52_usbreset(struct nrf52_usbdev_s *priv)
{
  struct nrf52_ep_s *privep = NULL;
  uint32_t           regval = 0;
  int                i      = 0;

  uinfo("nrf52_usbreset\n");

  /* Tell the class driver that we are disconnected. The class
   * driver should then accept any new configurations.
   */

  if (priv->driver)
    {
      CLASS_DISCONNECT(priv->driver, &priv->usbdev);
    }

  /* Mark all endpoints as available */

  priv->epavail[0] = NRF52_EP_AVAILABLE;
  priv->epavail[1] = NRF52_EP_AVAILABLE;

  /* Reset DMA and endpoint in-flight state */

  priv->dmanow      = false;
  priv->dmaepinwait = 0;
  priv->dmaepoutwait = 0;
  priv->epinflight  = 0;

  /* Disable all end points */

  for (i = 0; i < NRF52_NENDPOINTS ; i++)
    {
      /* Return write requests to the class implementation */

      privep = &priv->epin[i];
      nrf52_req_cancel(privep, -ESHUTDOWN);

      /* Reset IN endpoint status */

      privep->stalled = false;

      /* Stop EPIN task */

      nrf52_epin_stop(priv, i);

      /* Return read requests to the class implementation */

      privep = &priv->epout[i];
      nrf52_req_cancel(privep, -ESHUTDOWN);

      /* Reset endpoint status */

      privep->stalled = false;

      /* Stop EPOUT task */

      nrf52_epout_stop(priv, i);
    }

  /* Enable the interrupts */

  regval = NRF52_INT_DEFAULT;
  nrf52_putreg(regval, NRF52_USBD_INTEN);

  /* Reset device address to 0 */

  nrf52_setaddress(priv, 0);
  priv->usbdev.speed = USB_SPEED_FULL;

  /* Re-configure EP0 */

  nrf52_ep0_configure(priv);
}

/****************************************************************************
 * Name: nrf52_resumeinterrupt
 *
 * Description:
 *   Resume/remote wakeup detected interrupt
 *
 ****************************************************************************/

static void nrf52_resumeinterrupt(struct nrf52_usbdev_s *priv)
{
#ifdef CONFIG_USBDEV_LOWPOWER
  /* Force normal state */

  nrf52_putreg(0, NRF52_USBD_LOWPOWER);

  /* TODO: wait for event */
#endif

  /* Restore full power -- whatever that means for this particular board */

  nrf52_usbsuspend((struct usbdev_s *)priv, true);

  /* Notify the class driver of the resume event */

  if (priv->driver)
    {
      CLASS_RESUME(priv->driver, &priv->usbdev);
    }
}

/****************************************************************************
 * Name: nrf52_suspendinterrupt
 *
 * Description:
 *   USB suspend interrupt
 *
 ****************************************************************************/

static void nrf52_suspendinterrupt(struct nrf52_usbdev_s *priv)
{
  /* Notify the class driver of the suspend event */

  if (priv->driver)
    {
      CLASS_SUSPEND(priv->driver, &priv->usbdev);
    }

#ifdef CONFIG_USBDEV_LOWPOWER
  /* Force low power state */

  nrf52_putreg(1, NRF52_USBD_LOWPOWER);
#endif

  /* Let the board-specific logic know that we have entered the suspend
   * state
   */

  nrf52_usbsuspend((struct usbdev_s *)priv, false);
}

/****************************************************************************
 * Name: nrf52_eventinterrupt
 *
 * Description:
 *   Handle EVENT events
 *
 ****************************************************************************/

static void nrf52_eventinterrupt(struct nrf52_usbdev_s *priv)
{
  uint32_t regval = 0;
  uint32_t clr    = 0;

  regval = nrf52_getreg(NRF52_USBD_EVENTCAUSE);

  if (regval & USBD_EVENTCAUSE_ISOOUTCRC)
    {
      usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_ISOOUTCRC), 0);
      clr |= USBD_EVENTCAUSE_ISOOUTCRC;
    }

  if (regval & USBD_EVENTCAUSE_SUSPEND)
    {
      usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_SUSPEND), 0);
      nrf52_suspendinterrupt(priv);
      clr |= USBD_EVENTCAUSE_SUSPEND;
    }

  if (regval & USBD_EVENTCAUSE_RESUME)
    {
      usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_RESUME), 0);
      nrf52_resumeinterrupt(priv);
      clr |= USBD_EVENTCAUSE_RESUME;
    }

  if (regval & USBD_EVENTCAUSE_USBWUALLOWED)
    {
      usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_USBWUALLOWED), 0);
      clr |= USBD_EVENTCAUSE_USBWUALLOWED;
    }

  if (regval & USBD_EVENTCAUSE_READY)
    {
      usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_READY), 0);
      clr |= USBD_EVENTCAUSE_READY;
    }

  /* Clear all pending events */

  nrf52_putreg(clr, NRF52_USBD_EVENTCAUSE);
}

/****************************************************************************
 * Name: nrf52_ep0setupinterrupt
 *
 * Description:
 *   Handle EP0SETUP event
 *
 ****************************************************************************/

static void nrf52_ep0setupinterrupt(struct nrf52_usbdev_s *priv)
{
  /* Get SETUP data */

  priv->ctrlreq.type     = nrf52_getreg(NRF52_USBD_BMREQUESTTYPE);
  priv->ctrlreq.req      = nrf52_getreg(NRF52_USBD_BREQUEST);
  priv->ctrlreq.value[0] = nrf52_getreg(NRF52_USBD_WVALUEL);
  priv->ctrlreq.value[1] = nrf52_getreg(NRF52_USBD_WVALUEH);
  priv->ctrlreq.index[0] = nrf52_getreg(NRF52_USBD_WINDEXL);
  priv->ctrlreq.index[1] = nrf52_getreg(NRF52_USBD_WINDEXH);
  priv->ctrlreq.len[0]   = nrf52_getreg(NRF52_USBD_WLENGTHL);
  priv->ctrlreq.len[1]   = nrf52_getreg(NRF52_USBD_WLENGTHH);

  /* Store request len */

