apache/nuttx/arch/arm/src/nrf52/nrf52_usbd.c
  usbtrace(TRACE_DEVFREEEP, (uint16_t)privep->epphy);

  if (priv && privep)
    {
      /* Mark the endpoint as available */

      flags = enter_critical_section();
      priv->epavail[privep->isin] |= (1 << privep->epphy);
      leave_critical_section(flags);
    }
}

/****************************************************************************
 * Name: nrf52_getframe
 *
 * Description:
 *   Returns the current frame number
 *
 ****************************************************************************/

static int nrf52_getframe(struct usbdev_s *dev)
{
  usbtrace(TRACE_DEVGETFRAME, 0);

  /* Return the last frame number of the last SOF detected by the hardware */

  return nrf52_getreg(NRF52_USBD_FRAMECNTR) & USBD_FRAMECNTR_MASK;
}

/****************************************************************************
 * Name: nrf52_wakeup
 *
 * Description:
 *   Exit suspend mode.
 *
 ****************************************************************************/

static int nrf52_wakeup(struct usbdev_s *dev)
{
  struct nrf52_usbdev_s *priv = (struct nrf52_usbdev_s *)dev;
  irqstate_t             flags;

  usbtrace(TRACE_DEVWAKEUP, 0);

  /* Is wakeup enabled? */

  flags = enter_critical_section();
  if (priv->wakeup)
    {
#ifdef CONFIG_USBDEV_LOWPOWER
      /* Force normal state */

      nrf52_putreg(0, NRF52_USBD_LOWPOWER);

      /* TODO: wait for event */
#endif

      /* Revisit: */
#if 0
      nrf52_putreg(USBD_DPDMVALUE_STATE_RESUME, NRF52_USBD_DPDMVALUE);
      nrf52_putreg(1, NRF52_USBD_TASKS_DPDMDRIVE);
#endif
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: nrf52_selfpowered
 *
 * Description:
 *   Sets/clears the device self-powered feature
 *
 ****************************************************************************/

static int nrf52_selfpowered(struct usbdev_s *dev, bool selfpowered)
{
  struct nrf52_usbdev_s *priv = (struct nrf52_usbdev_s *)dev;

  usbtrace(TRACE_DEVSELFPOWERED, (uint16_t)selfpowered);

#ifdef CONFIG_DEBUG_FEATURES
  if (!dev)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_INVALIDPARMS), 0);
      return -ENODEV;
    }
#endif

  priv->selfpowered = selfpowered;
  return OK;
}

/****************************************************************************
 * Name: nrf52_pullup
 *
 * Description:
 *   Software-controlled connect to/disconnect from USB host
 *
 ****************************************************************************/

int nrf52_pullup(struct usbdev_s *dev, bool enable)
{
  if (enable)
    {
      nrf52_putreg(USBD_USBPULLUP_ENABLE, NRF52_USBD_USBPULLUP);
    }
  else
    {
      nrf52_putreg(USBD_USBPULLUP_DISABLE, NRF52_USBD_USBPULLUP);
    }

  return OK;
}

/****************************************************************************
 * Name: nrf52_setaddress
 *
 * Description:
 *   Set the devices USB address
 *
 ****************************************************************************/

static void nrf52_setaddress(struct nrf52_usbdev_s *priv, uint16_t address)
{
  /* Are we now addressed?  (i.e., do we have a non-NULL device
   * address?)
   */

  if (address != 0)
    {
      priv->addressed = true;
    }
  else
    {
      priv->addressed = false;
    }
}

/****************************************************************************
 * Name: nrf52_swinitialize
 *
 * Description:
 *   Initialize all driver data structures.
 *
 ****************************************************************************/

static void nrf52_swinitialize(struct nrf52_usbdev_s *priv)
{
  struct nrf52_ep_s *privep;
  int i;

  /* Initialize the device state structure */

  memset(priv, 0, sizeof(struct nrf52_usbdev_s));

  priv->usbdev.ops = &g_devops;
  priv->usbdev.ep0 = &priv->epin[EP0].ep;

  priv->epavail[0] = NRF52_EP_AVAILABLE;
  priv->epavail[1] = NRF52_EP_AVAILABLE;

  /* Initialize the endpoint lists */

  for (i = 0; i < NRF52_NENDPOINTS; i++)
    {
      privep         = &priv->epin[i];
      privep->ep.ops = &g_epops;
      privep->dev    = priv;
      privep->isin   = 1;

      /* The index, i, is the physical endpoint address;  Map this
       * to a logical endpoint address usable by the class driver.
       */

      privep->epphy    = i;
      privep->ep.eplog = NRF52_EPPHYIN2LOG(i);

      /* Control until endpoint is activated */

      privep->eptype       = USB_EP_ATTR_XFER_CONTROL;
      privep->ep.maxpacket = USBDEV_EP0_MAXSIZE;
    }

  /* Initialize the endpoint lists */

  for (i = 0; i < NRF52_NENDPOINTS; i++)
    {
      privep         = &priv->epout[i];
      privep->ep.ops = &g_epops;
      privep->dev    = priv;

      /* The index, i, is the physical endpoint address;  Map this
       * to a logical endpoint address usable by the class driver.
       */

      privep->epphy    = i;
      privep->ep.eplog = NRF52_EPPHYOUT2LOG(i);

      /* Control until endpoint is activated */

      privep->eptype       = USB_EP_ATTR_XFER_CONTROL;
      privep->ep.maxpacket = USBDEV_EP0_MAXSIZE;
    }
}

/****************************************************************************
 * Name: nrf52_hwinitialize
 *
 * Description:
 *   Configure the USB core for operation.
 *
 ****************************************************************************/

static void nrf52_hwinitialize(struct nrf52_usbdev_s *priv)
{
  /* Wait for VBUS */

  while ((getreg32(NRF52_POWER_USBREGSTATUS) &
          NRF52_POWER_USBREGSTATUS_VBUSDETECT) == 0) ;

  /* Errata [187] USBD: USB cannot be enabled */

  *(volatile uint32_t *)0x4006ec00 = 0x00009375;
  *(volatile uint32_t *)0x4006ed14 = 0x00000003;
  *(volatile uint32_t *)0x4006ec00 = 0x00009375;

  /* Enable the USB controller */

  nrf52_putreg(USBD_ENABLE_ENABLE, NRF52_USBD_ENABLE);

  while ((nrf52_getreg(NRF52_USBD_EVENTCAUSE) & USBD_EVENTCAUSE_READY) == 0);
  nrf52_putreg(USBD_EVENTCAUSE_READY, NRF52_USBD_EVENTCAUSE);

  *(volatile uint32_t *)0x4006ec00 = 0x00009375;
  *(volatile uint32_t *)0x4006ed14 = 0x00000000;
  *(volatile uint32_t *)0x4006ec00 = 0x00009375;

